SigninLogs
| where TimeGenerated > ago(1d)
| where UserPrincipalName == "@{outputs('Compose_Email')}" // example user@youremail.com
| project TimeGenerated, Location, IPAddress, AppDisplayName, UserId
| sort by TimeGenerated desc
